const transliterationDictionary = new Map([
    ['а', 'a'], ['А', 'A'],    ['б', 'b'], ['Б', 'B'],    ['в', 'v'], ['В', 'V'],
    ['г', 'h'], ['Г', 'H'],    ['ґ', 'g'], ['Ґ', 'G'],    ['д', 'd'], ['Д', 'D'],
    ['е', 'e'], ['Е', 'E'],    ['є', 'ie'], ['Є', 'Ie'],    ['ж', 'zh'], ['Ж', 'Zh'],
    ['з', 'z'], ['З', 'Z'],    ['и', 'y'], ['И', 'Y'],    ['і', 'i'], ['І', 'I'],
    ['ї', 'i'], ['Ї', 'I'],    ['й', 'i'], ['Й', 'I'],    ['к', 'k'], ['К', 'K'],
    ['л', 'l'], ['Л', 'L'],    ['м', 'm'], ['М', 'M'],    ['н', 'n'], ['Н', 'N'],
    ['о', 'o'], ['О', 'O'],    ['п', 'p'], ['П', 'P'],    ['р', 'r'], ['Р', 'R'],
    ['с', 's'], ['С', 'S'],    ['т', 't'], ['Т', 'T'],    ['у', 'u'], ['У', 'U'],
    ['ф', 'f'], ['Ф', 'F'],    ['х', 'kh'], ['Х', 'Kh'],    ['ц', 'ts'], ['Ц', 'Ts'],
    ['ч', 'ch'], ['Ч', 'Ch'],    ['ш', 'sh'], ['Ш', 'Sh'],    ['щ', 'sch'], ['Щ', 'Sch'],
    ['ь', ''], ['Ь', ''],    ['ю', 'iu'], ['Ю', 'Iu'],    ['я', 'ia'], ['Я', 'Ia'], 

    ['.', '.'],    [',', ','],    ['!', '!'],    ['?', '?'],    [';', ';'],    [':', ':'],
    ['-', '-'],    ['(', '('],    [')', ')'],    ['[', '['],    [']', ']'],    ['{', '{'],
    ['}', '}'],    ['/', '/'],    ['"', '"'],    ["'", "'"],    ['<', '<'],    ['>', '>'], 
    ['*', '*'],    ['&', '&'],    ['%', '%'],    ['$', '$'],    ['#', '#'],
    ['@', '@'],    ['^', '^'],    ['|', '|'],    ['`', '`'],    [' ', ' '],
]);

const input = document.querySelector("#input");
input.addEventListener("input", () => {
    const outputArr = [];
    for(const char of input.value) {
        const transliteratedChar = transliterationDictionary.get(char);
        if (transliteratedChar !== undefined) {
            outputArr.push(transliteratedChar);
        }
    }
    document.querySelector("#output").value = outputArr.join('');
});
